Revit 2026 API
GeometryCreationUtilities.CreateFixedReferenceSweptGeometry Method
Overload List
Name | Description
CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, XYZ)
CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IList<CurveLoop>, XYZ, SolidOptions)
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace